// automatically generated by rust-bindgen

#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(unused)]

pub(crate) const xltypeNum: u32 = 1;
pub(crate) const xltypeStr: u32 = 2;
pub(crate) const xltypeBool: u32 = 4;
pub(crate) const xltypeRef: u32 = 8;
pub(crate) const xltypeErr: u32 = 16;
pub(crate) const xltypeFlow: u32 = 32;
pub(crate) const xltypeMulti: u32 = 64;
pub(crate) const xltypeMissing: u32 = 128;
pub(crate) const xltypeNil: u32 = 256;
pub(crate) const xltypeSRef: u32 = 1024;
pub(crate) const xltypeInt: u32 = 2048;
pub(crate) const xlbitXLFree: u32 = 4096;
pub(crate) const xlbitDLLFree: u32 = 16384;
pub(crate) const xltypeBigData: u32 = 2050;
pub(crate) const xlerrNull: u32 = 0;
pub(crate) const xlerrDiv0: u32 = 7;
pub(crate) const xlerrValue: u32 = 15;
pub(crate) const xlerrRef: u32 = 23;
pub(crate) const xlerrName: u32 = 29;
pub(crate) const xlerrNum: u32 = 36;
pub(crate) const xlerrNA: u32 = 42;
pub(crate) const xlerrGettingData: u32 = 43;
pub(crate) const xlflowHalt: u32 = 1;
pub(crate) const xlflowGoto: u32 = 2;
pub(crate) const xlflowRestart: u32 = 8;
pub(crate) const xlflowPause: u32 = 16;
pub(crate) const xlflowResume: u32 = 64;
pub(crate) const xlretSuccess: u32 = 0;
pub(crate) const xlretAbort: u32 = 1;
pub(crate) const xlretInvXlfn: u32 = 2;
pub(crate) const xlretInvCount: u32 = 4;
pub(crate) const xlretInvXloper: u32 = 8;
pub(crate) const xlretStackOvfl: u32 = 16;

pub(crate) const xlcSeriesY: u32 = 33230;
pub(crate) const xlcErrorbarX: u32 = 33231;
pub(crate) const xlcErrorbarY: u32 = 33232;
pub(crate) const xlcFormatChart: u32 = 33233;
pub(crate) const xlcSeriesOrder: u32 = 33234;
pub(crate) const xlcMailLogoff: u32 = 33235;
pub(crate) const xlcClearRoutingSlip: u32 = 33236;
pub(crate) const xlcAppActivateMicrosoft: u32 = 33237;
pub(crate) const xlcMailEditMailer: u32 = 33238;
pub(crate) const xlcOnSheet: u32 = 33239;
pub(crate) const xlcStandardWidth: u32 = 33240;
pub(crate) const xlcScenarioMerge: u32 = 33241;
pub(crate) const xlcSummaryInfo: u32 = 33242;
pub(crate) const xlcFindFile: u32 = 33243;
pub(crate) const xlcActiveCellFont: u32 = 33244;
pub(crate) const xlcEnableTipwizard: u32 = 33245;
pub(crate) const xlcVbaMakeAddin: u32 = 33246;
pub(crate) const xlcInsertdatatable: u32 = 33248;
pub(crate) const xlcWorkgroupOptions: u32 = 33249;
pub(crate) const xlcMailSendMailer: u32 = 33250;
pub(crate) const xlcAutocorrect: u32 = 33253;
pub(crate) const xlcPostDocument: u32 = 33257;
pub(crate) const xlcPicklist: u32 = 33259;
pub(crate) const xlcViewShow: u32 = 33261;
pub(crate) const xlcViewDefine: u32 = 33262;
pub(crate) const xlcViewDelete: u32 = 33263;
pub(crate) const xlcSheetBackground: u32 = 33277;
pub(crate) const xlcInsertMapObject: u32 = 33278;
pub(crate) const xlcOptionsMenono: u32 = 33279;
pub(crate) const xlcNormal: u32 = 33286;
pub(crate) const xlcLayout: u32 = 33287;
pub(crate) const xlcRmPrintArea: u32 = 33288;
pub(crate) const xlcClearPrintArea: u32 = 33289;
pub(crate) const xlcAddPrintArea: u32 = 33290;
pub(crate) const xlcMoveBrk: u32 = 33291;
pub(crate) const xlcHidecurrNote: u32 = 33313;
pub(crate) const xlcHideallNotes: u32 = 33314;
pub(crate) const xlcDeleteNote: u32 = 33315;
pub(crate) const xlcTraverseNotes: u32 = 33316;
pub(crate) const xlcActivateNotes: u32 = 33317;
pub(crate) const xlcProtectRevisions: u32 = 33388;
pub(crate) const xlcUnprotectRevisions: u32 = 33389;
pub(crate) const xlcOptionsMe: u32 = 33415;
pub(crate) const xlcWebPublish: u32 = 33421;
pub(crate) const xlcNewwebquery: u32 = 33435;
pub(crate) const xlcPivotTableChart: u32 = 33441;
pub(crate) const xlcOptionsSave: u32 = 33521;
pub(crate) const xlcOptionsSpell: u32 = 33523;
pub(crate) const xlcHideallInkannots: u32 = 33576;
pub(crate) type BOOL = ::std::os::raw::c_int;
pub(crate) type BYTE = ::std::os::raw::c_uchar;
pub(crate) type WORD = ::std::os::raw::c_ushort;
pub(crate) type DWORD = ::std::os::raw::c_ulong;
pub(crate) type INT32 = ::std::os::raw::c_int;
pub(crate) type ULONG_PTR = ::std::os::raw::c_ulonglong;
pub(crate) type DWORD_PTR = ULONG_PTR;
pub(crate) type CHAR = ::std::os::raw::c_char;
pub(crate) type LONG = ::std::os::raw::c_long;
pub(crate) type WCHAR = u16;
pub(crate) type LPSTR = *mut CHAR;
pub(crate) type HANDLE = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct HWND__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HWND__"][::std::mem::size_of::<HWND__>() - 4usize];
    ["Alignment of HWND__"][::std::mem::align_of::<HWND__>() - 4usize];
    ["Offset of field: HWND__::unused"][::std::mem::offset_of!(HWND__, unused) - 0usize];
};
pub(crate) type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct tagPOINT {
    pub x: LONG,
    pub y: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagPOINT"][::std::mem::size_of::<tagPOINT>() - 8usize];
    ["Alignment of tagPOINT"][::std::mem::align_of::<tagPOINT>() - 4usize];
    ["Offset of field: tagPOINT::x"][::std::mem::offset_of!(tagPOINT, x) - 0usize];
    ["Offset of field: tagPOINT::y"][::std::mem::offset_of!(tagPOINT, y) - 4usize];
};
pub(crate) type POINT = tagPOINT;
pub(crate) type XCHAR = WCHAR;
pub(crate) type RW = INT32;
pub(crate) type COL = INT32;
pub(crate) type IDSHEET = DWORD_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xlref {
    pub rwFirst: WORD,
    pub rwLast: WORD,
    pub colFirst: BYTE,
    pub colLast: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xlref"][::std::mem::size_of::<xlref>() - 6usize];
    ["Alignment of xlref"][::std::mem::align_of::<xlref>() - 2usize];
    ["Offset of field: xlref::rwFirst"][::std::mem::offset_of!(xlref, rwFirst) - 0usize];
    ["Offset of field: xlref::rwLast"][::std::mem::offset_of!(xlref, rwLast) - 2usize];
    ["Offset of field: xlref::colFirst"]
        [::std::mem::offset_of!(xlref, colFirst) - 4usize];
    ["Offset of field: xlref::colLast"][::std::mem::offset_of!(xlref, colLast) - 5usize];
};
pub(crate) type XLREF = xlref;
pub(crate) type LPXLREF = *mut xlref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xlmref {
    pub count: WORD,
    pub reftbl: [XLREF; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xlmref"][::std::mem::size_of::<xlmref>() - 8usize];
    ["Alignment of xlmref"][::std::mem::align_of::<xlmref>() - 2usize];
    ["Offset of field: xlmref::count"][::std::mem::offset_of!(xlmref, count) - 0usize];
    ["Offset of field: xlmref::reftbl"][::std::mem::offset_of!(xlmref, reftbl) - 2usize];
};
pub(crate) type XLMREF = xlmref;
pub(crate) type LPXLMREF = *mut xlmref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xlref12 {
    pub rwFirst: RW,
    pub rwLast: RW,
    pub colFirst: COL,
    pub colLast: COL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xlref12"][::std::mem::size_of::<xlref12>() - 16usize];
    ["Alignment of xlref12"][::std::mem::align_of::<xlref12>() - 4usize];
    ["Offset of field: xlref12::rwFirst"]
        [::std::mem::offset_of!(xlref12, rwFirst) - 0usize];
    ["Offset of field: xlref12::rwLast"]
        [::std::mem::offset_of!(xlref12, rwLast) - 4usize];
    ["Offset of field: xlref12::colFirst"]
        [::std::mem::offset_of!(xlref12, colFirst) - 8usize];
    ["Offset of field: xlref12::colLast"]
        [::std::mem::offset_of!(xlref12, colLast) - 12usize];
};
pub(crate) type XLREF12 = xlref12;
pub(crate) type LPXLREF12 = *mut xlref12;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xlmref12 {
    pub count: WORD,
    pub reftbl: [XLREF12; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xlmref12"][::std::mem::size_of::<xlmref12>() - 20usize];
    ["Alignment of xlmref12"][::std::mem::align_of::<xlmref12>() - 4usize];
    ["Offset of field: xlmref12::count"]
        [::std::mem::offset_of!(xlmref12, count) - 0usize];
    ["Offset of field: xlmref12::reftbl"]
        [::std::mem::offset_of!(xlmref12, reftbl) - 4usize];
};
pub(crate) type XLMREF12 = xlmref12;
pub(crate) type LPXLMREF12 = *mut xlmref12;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct _FP {
    pub rows: ::std::os::raw::c_ushort,
    pub columns: ::std::os::raw::c_ushort,
    pub array: [f64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FP"][::std::mem::size_of::<_FP>() - 16usize];
    ["Alignment of _FP"][::std::mem::align_of::<_FP>() - 8usize];
    ["Offset of field: _FP::rows"][::std::mem::offset_of!(_FP, rows) - 0usize];
    ["Offset of field: _FP::columns"][::std::mem::offset_of!(_FP, columns) - 2usize];
    ["Offset of field: _FP::array"][::std::mem::offset_of!(_FP, array) - 8usize];
};
pub(crate) type FP = _FP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct _FP12 {
    pub rows: INT32,
    pub columns: INT32,
    pub array: [f64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FP12"][::std::mem::size_of::<_FP12>() - 16usize];
    ["Alignment of _FP12"][::std::mem::align_of::<_FP12>() - 8usize];
    ["Offset of field: _FP12::rows"][::std::mem::offset_of!(_FP12, rows) - 0usize];
    ["Offset of field: _FP12::columns"][::std::mem::offset_of!(_FP12, columns) - 4usize];
    ["Offset of field: _FP12::array"][::std::mem::offset_of!(_FP12, array) - 8usize];
};
pub(crate) type FP12 = _FP12;
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper {
    pub val: xloper__bindgen_ty_1,
    pub xltype: WORD,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper__bindgen_ty_1 {
    pub num: f64,
    pub str_: LPSTR,
    pub xbool: WORD,
    pub err: WORD,
    pub w: ::std::os::raw::c_short,
    pub sref: xloper__bindgen_ty_1__bindgen_ty_1,
    pub mref: xloper__bindgen_ty_1__bindgen_ty_2,
    pub array: xloper__bindgen_ty_1__bindgen_ty_3,
    pub flow: xloper__bindgen_ty_1__bindgen_ty_4,
    pub bigdata: xloper__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper__bindgen_ty_1__bindgen_ty_1 {
    pub count: WORD,
    pub ref_: XLREF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<xloper__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<xloper__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_1::count"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_1, count) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_1, ref_) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper__bindgen_ty_1__bindgen_ty_2 {
    pub lpmref: *mut XLMREF,
    pub idSheet: IDSHEET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<xloper__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<xloper__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_2::lpmref"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_2, lpmref) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_2::idSheet"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_2, idSheet) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper__bindgen_ty_1__bindgen_ty_3 {
    pub lparray: *mut xloper,
    pub rows: WORD,
    pub columns: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<xloper__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<xloper__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_3::lparray"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_3, lparray) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_3::rows"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_3, rows) - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_3::columns"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_3, columns) - 10usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper__bindgen_ty_1__bindgen_ty_4 {
    pub valflow: xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    pub rw: WORD,
    pub col: BYTE,
    pub xlflow: BYTE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub level: ::std::os::raw::c_short,
    pub tbctrl: ::std::os::raw::c_short,
    pub idSheet: IDSHEET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"][::std::mem::size_of::<
        xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"][::std::mem::align_of::<
        xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::level"][::std::mem::offset_of!(
        xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        level
    )
        - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::tbctrl"][::std::mem::offset_of!(
        xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        tbctrl
    )
        - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::idSheet"][::std::mem::offset_of!(
        xloper__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        idSheet
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<xloper__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<xloper__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4::valflow"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_4, valflow) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4::rw"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_4, rw) - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4::col"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_4, col) - 10usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_4::xlflow"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_4, xlflow) - 11usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper__bindgen_ty_1__bindgen_ty_5 {
    pub h: xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    pub cbData: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub lpbData: *mut BYTE,
    pub hdata: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"][::std::mem::size_of::<
        xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"][::std::mem::align_of::<
        xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::lpbData"][::std::mem::offset_of!(
        xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        lpbData
    )
        - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::hdata"][::std::mem::offset_of!(
        xloper__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        hdata
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<xloper__bindgen_ty_1__bindgen_ty_5>() - 16usize];
    ["Alignment of xloper__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<xloper__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_5::h"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_5, h) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1__bindgen_ty_5::cbData"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1__bindgen_ty_5, cbData) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper__bindgen_ty_1"]
        [::std::mem::size_of::<xloper__bindgen_ty_1>() - 16usize];
    ["Alignment of xloper__bindgen_ty_1"]
        [::std::mem::align_of::<xloper__bindgen_ty_1>() - 8usize];
    ["Offset of field: xloper__bindgen_ty_1::num"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, num) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, str_) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::xbool"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, xbool) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::err"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, err) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::w"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, w) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::sref"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, sref) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::mref"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, mref) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::array"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, array) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::flow"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, flow) - 0usize];
    ["Offset of field: xloper__bindgen_ty_1::bigdata"]
        [::std::mem::offset_of!(xloper__bindgen_ty_1, bigdata) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper"][::std::mem::size_of::<xloper>() - 24usize];
    ["Alignment of xloper"][::std::mem::align_of::<xloper>() - 8usize];
    ["Offset of field: xloper::val"][::std::mem::offset_of!(xloper, val) - 0usize];
    ["Offset of field: xloper::xltype"][::std::mem::offset_of!(xloper, xltype) - 16usize];
};
pub(crate) type XLOPER = xloper;
pub(crate) type LPXLOPER = *mut xloper;
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper12 {
    pub val: xloper12__bindgen_ty_1,
    pub xltype: DWORD,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper12__bindgen_ty_1 {
    pub num: f64,
    pub str_: *mut XCHAR,
    pub xbool: BOOL,
    pub err: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
    pub sref: xloper12__bindgen_ty_1__bindgen_ty_1,
    pub mref: xloper12__bindgen_ty_1__bindgen_ty_2,
    pub array: xloper12__bindgen_ty_1__bindgen_ty_3,
    pub flow: xloper12__bindgen_ty_1__bindgen_ty_4,
    pub bigdata: xloper12__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper12__bindgen_ty_1__bindgen_ty_1 {
    pub count: WORD,
    pub ref_: XLREF12,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1__bindgen_ty_1>() - 20usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_1::count"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_1, count) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_1, ref_) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper12__bindgen_ty_1__bindgen_ty_2 {
    pub lpmref: *mut XLMREF12,
    pub idSheet: IDSHEET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_2::lpmref"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_2, lpmref) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_2::idSheet"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_2, idSheet) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct xloper12__bindgen_ty_1__bindgen_ty_3 {
    pub lparray: *mut xloper12,
    pub rows: RW,
    pub columns: COL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_3::lparray"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_3, lparray) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_3::rows"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_3, rows) - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_3::columns"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_3, columns) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper12__bindgen_ty_1__bindgen_ty_4 {
    pub valflow: xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    pub rw: RW,
    pub col: COL,
    pub xlflow: BYTE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub level: ::std::os::raw::c_int,
    pub tbctrl: ::std::os::raw::c_int,
    pub idSheet: IDSHEET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"][::std::mem::size_of::<
        xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::level"][::std::mem::offset_of!(
        xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        level
    )
        - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::tbctrl"][::std::mem::offset_of!(
        xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        tbctrl
    )
        - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::idSheet"][::std::mem::offset_of!(
        xloper12__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        idSheet
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1__bindgen_ty_4>() - 24usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4::valflow"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_4, valflow) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4::rw"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_4, rw) - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4::col"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_4, col) - 12usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_4::xlflow"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_4, xlflow) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct xloper12__bindgen_ty_1__bindgen_ty_5 {
    pub h: xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    pub cbData: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) union xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub lpbData: *mut BYTE,
    pub hdata: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"][::std::mem::size_of::<
        xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::lpbData"][::std::mem::offset_of!(
        xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        lpbData
    )
        - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::hdata"][::std::mem::offset_of!(
        xloper12__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        hdata
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1__bindgen_ty_5>() - 16usize];
    ["Alignment of xloper12__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_5::h"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_5, h) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1__bindgen_ty_5::cbData"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1__bindgen_ty_5, cbData) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12__bindgen_ty_1"]
        [::std::mem::size_of::<xloper12__bindgen_ty_1>() - 24usize];
    ["Alignment of xloper12__bindgen_ty_1"]
        [::std::mem::align_of::<xloper12__bindgen_ty_1>() - 8usize];
    ["Offset of field: xloper12__bindgen_ty_1::num"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, num) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, str_) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::xbool"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, xbool) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::err"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, err) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::w"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, w) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::sref"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, sref) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::mref"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, mref) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::array"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, array) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::flow"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, flow) - 0usize];
    ["Offset of field: xloper12__bindgen_ty_1::bigdata"]
        [::std::mem::offset_of!(xloper12__bindgen_ty_1, bigdata) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xloper12"][::std::mem::size_of::<xloper12>() - 32usize];
    ["Alignment of xloper12"][::std::mem::align_of::<xloper12>() - 8usize];
    ["Offset of field: xloper12::val"][::std::mem::offset_of!(xloper12, val) - 0usize];
    ["Offset of field: xloper12::xltype"]
        [::std::mem::offset_of!(xloper12, xltype) - 24usize];
};
pub(crate) type XLOPER12 = xloper12;
pub(crate) type LPXLOPER12 = *mut xloper12;
extern "C" {
    pub fn Excel4(
        xlfn: ::std::os::raw::c_int,
        operRes: LPXLOPER,
        count: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Excel4v(
        xlfn: ::std::os::raw::c_int,
        operRes: LPXLOPER,
        count: ::std::os::raw::c_int,
        opers: *mut LPXLOPER,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XLCallVer() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LPenHelper(
        wCode: ::std::os::raw::c_int,
        lpv: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn Excel12(
        xlfn: ::std::os::raw::c_int,
        operRes: LPXLOPER12,
        count: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Excel12v(
        xlfn: ::std::os::raw::c_int,
        operRes: LPXLOPER12,
        count: ::std::os::raw::c_int,
        opers: *mut LPXLOPER12,
    ) -> ::std::os::raw::c_int;
}
pub(crate) type PXL_HPC_ASYNC_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        operAsyncHandle: LPXLOPER12,
        operReturn: LPXLOPER12,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct _fmlainfo {
    pub wPointMode: ::std::os::raw::c_int,
    pub cch: ::std::os::raw::c_int,
    pub lpch: *mut ::std::os::raw::c_char,
    pub ichFirst: ::std::os::raw::c_int,
    pub ichLast: ::std::os::raw::c_int,
    pub ichCaret: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmlainfo"][::std::mem::size_of::<_fmlainfo>() - 32usize];
    ["Alignment of _fmlainfo"][::std::mem::align_of::<_fmlainfo>() - 8usize];
    ["Offset of field: _fmlainfo::wPointMode"]
        [::std::mem::offset_of!(_fmlainfo, wPointMode) - 0usize];
    ["Offset of field: _fmlainfo::cch"][::std::mem::offset_of!(_fmlainfo, cch) - 4usize];
    ["Offset of field: _fmlainfo::lpch"]
        [::std::mem::offset_of!(_fmlainfo, lpch) - 8usize];
    ["Offset of field: _fmlainfo::ichFirst"]
        [::std::mem::offset_of!(_fmlainfo, ichFirst) - 16usize];
    ["Offset of field: _fmlainfo::ichLast"]
        [::std::mem::offset_of!(_fmlainfo, ichLast) - 20usize];
    ["Offset of field: _fmlainfo::ichCaret"]
        [::std::mem::offset_of!(_fmlainfo, ichCaret) - 24usize];
};
pub(crate) type FMLAINFO = _fmlainfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct _mouseinfo {
    pub hwnd: HWND,
    pub pt: POINT,
    pub dt: ::std::os::raw::c_int,
    pub ht: ::std::os::raw::c_int,
    pub rw: ::std::os::raw::c_int,
    pub col: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mouseinfo"][::std::mem::size_of::<_mouseinfo>() - 32usize];
    ["Alignment of _mouseinfo"][::std::mem::align_of::<_mouseinfo>() - 8usize];
    ["Offset of field: _mouseinfo::hwnd"]
        [::std::mem::offset_of!(_mouseinfo, hwnd) - 0usize];
    ["Offset of field: _mouseinfo::pt"][::std::mem::offset_of!(_mouseinfo, pt) - 8usize];
    ["Offset of field: _mouseinfo::dt"][::std::mem::offset_of!(_mouseinfo, dt) - 16usize];
    ["Offset of field: _mouseinfo::ht"][::std::mem::offset_of!(_mouseinfo, ht) - 20usize];
    ["Offset of field: _mouseinfo::rw"][::std::mem::offset_of!(_mouseinfo, rw) - 24usize];
    ["Offset of field: _mouseinfo::col"]
        [::std::mem::offset_of!(_mouseinfo, col) - 28usize];
};
pub(crate) type MOUSEINFO = _mouseinfo;
